In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/samarasouzaa/TP2/main/meteorite-landings.csv")

In [3]:
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"

In [4]:
pd.value_counts(df['reclat'])

 0.00000     6438
-71.50000    4761
-84.00000    3040
-72.00000    1506
-79.68333    1130
             ...
-84.60051       1
 20.93930       1
-76.26494       1
 40.37972       1
 2.00000        1
Name: reclat, Length: 12738, dtype: int64

In [6]:
pd.value_counts(df['reclong'])

 0.000000      6214
 35.666670     4985
 168.000000    3040
 26.000000     1506
 159.750000     657
               ...
 54.472611        1
 53.803920        1
-64.783330        1
 156.410380       1
 36.186110        1
Name: reclong, Length: 14640, dtype: int64

In [7]:
df = df.query('reclong != 0.00000 & reclat != 0.00000')

In [8]:
pd.value_counts(df['reclat'])

-71.50000    4761
-84.00000    3040
-72.00000    1506
-79.68333    1130
-76.71667     680
             ...
-84.60051       1
 20.93930       1
-76.26494       1
 40.37972       1
 2.00000        1
Name: reclat, Length: 12737, dtype: int64

In [9]:
pd.value_counts(df['year'])

2003.0    3283
1979.0    3046
1988.0    2296
2006.0    2063
2002.0    2038
          ...
1806.0       1
1399.0       1
1766.0       1
1704.0       1
1741.0       1
Name: year, Length: 267, dtype: int64

In [10]:
df.query('year > 2016')

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
38188,Ur,24125,Valid,Iron,NaN,Found,2501.0,30.9,46.01667,"(30.900000, 46.016670)"

In [11]:
df.query('year > 2016')

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
38188,Ur,24125,Valid,Iron,NaN,Found,2501.0,30.9,46.01667,"(30.900000, 46.016670)"

In [12]:
df = df.drop(38188)

In [13]:
df.query('year > 2016')

Empty DataFrame
Columns: [name, id, nametype, recclass, mass, fall, year, reclat, reclong, GeoLocation]
Index: []

In [14]:
df.to_csv('meteorite-landings_2.csv')

In [15]:
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"